<a href="https://colab.research.google.com/github/archelsea/pandas/blob/main/02.W_R_Data.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd

# Read Data

In [2]:
location = '/content/drive/MyDrive/Python Pandas/titanic.csv'

In [5]:
titanic = pd.read_csv(location)
titanic.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [6]:
# titanic = pd.read_csv('https://raw.githubusercontent.com/pandas-dev/pandas/master/doc/data/titanic.csv')

# Check Data

In [7]:
titanic.sample(10)

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
697          698         1       3  ...   7.7333   NaN         Q
181          182         0       2  ...  15.0500   NaN         C
140          141         0       3  ...  15.2458   NaN         C
620          621         0       3  ...  14.4542   NaN         C
485          486         0       3  ...  25.4667   NaN         S
799          800         0       3  ...  24.1500   NaN         S
464          465         0       3  ...   8.0500   NaN         S
32            33         1       3  ...   7.7500   NaN         Q
546          547         1       2  ...  26.0000   NaN         S
772          773         0       2  ...  10.5000   E77         S

[10 rows x 12 columns]

In [8]:
titanic['Age'].head()

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: Age, dtype: float64

In [9]:
titanic.dtypes #attribute

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [10]:
titanic.info() #method

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

# Save to File

In [11]:
titanic.to_excel('titanic.xlsx',sheet_name='passengers', index=False)